app/Models/ModelPengembalian.php

INSERT INTO `tb_pengembalian` (`id_pengembalian`, `id_member`, `id_peminjaman`, `tanggal_pengembalian`, `total_pengembalian`, `hari_keterlambatan`, `total_denda`, `uang_dibayarkan`, `uang_kembalian`) VALUES (NULL, '5', '36', '2024-02-01', '1', '1', '2000', '2000', '0')
---
    public function tambah_pengembalian($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);