app/Models/ModelMember.php

SELECT *
FROM `tb_member`
WHERE `email` = 'Fahri@gmail.com'
---
    public function dapatkan_member($email = false)
    {
        if ($email === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['email' => $email]);