app/Models/ModelUlasan.php

    public function ulasanByBuku($id_buku)
    {
        return $this->select('tb_ulasan_buku.*, tb_member.*, tb_buku.*')
        ->join('tb_member', 'tb_member.id_member = tb_ulasan_buku.id_member')
        ->join('tb_buku', 'tb_buku.id_buku = tb_ulasan_buku.id_buku')
        ->where('tb_ulasan_buku.id_buku', $id_buku) // Ubah agar spesifik ke kolom ulasan_buku
        ->get()
        ->getResultArray();
---
SELECT `tb_ulasan_buku`.*, `tb_member`.*, `tb_buku`.*
FROM `tb_ulasan_buku`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_ulasan_buku`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_ulasan_buku`.`id_buku`
WHERE `tb_ulasan_buku`.`id_buku` = 'BK-009'