app/Models/ModelKoleksiBuku.php

    public function tambah_koleksi($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);
---
INSERT INTO `tb_koleksi_buku` (`id_member`, `id_buku`, `id_kategori_buku`) VALUES ('1', '008', '006')

     public function semua_koleksi_by_member($id_member)
     {
         $query = $this->db->table('tb_koleksi_buku');
         $result = $query->select('*')
             ->join('tb_member', 'tb_member.id_member = tb_koleksi_buku.id_member')
             ->join('tb_buku', 'tb_buku.id_buku = tb_koleksi_buku.id_buku')
             ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = tb_buku.id_kategori_buku')
             ->where('tb_koleksi_buku.id_member', $id_member)
             ->get()
             ->getResultArray();
---
SELECT *
FROM `tb_koleksi_buku`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_koleksi_buku`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_koleksi_buku`.`id_buku`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
WHERE `tb_koleksi_buku`.`id_member` = '1'

    public function cek_user_koleksi($id_member, $id_buku)
    {
        return $this->getWhere([
            'id_member' => $id_member,
            'id_buku' => $id_buku,
        ])->getRow();
---
SELECT *
FROM `tb_koleksi_buku`
WHERE `id_member` = '1'
AND `id_buku` = '008'