app/Models/ModelPetugas.php

SELECT `id_petugas`
FROM `tb_petugas`
WHERE `id_petugas` LIKE 'A%' ESCAPE '!'
---
    public function kode_admin() {
        $query = $this->db->table('tb_petugas');
        $query->like('id_petugas', 'A', 'after');
        $query->select('id_petugas');
        $result = $query->get()->getResult();

SELECT `id_petugas`
FROM `tb_petugas`
WHERE `id_petugas` LIKE 'P%' ESCAPE '!'
---
    public function kode_petugas() {
        $query = $this->db->table('tb_petugas');
        $query->like('id_petugas', 'P', 'after');
        $query->select('id_petugas');
        $result = $query->get()->getResult();

SELECT *
FROM `tb_petugas`
WHERE `role` = 'admin'
---
    public function semua_admin()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->where('role', 'admin')
            ->get()
            ->getResultArray();

SELECT *
FROM `tb_petugas`
WHERE `role` = 'petugas'
---
    public function semua_petugas()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->where('role', 'petugas')
            ->get()
            ->getResultArray();