app/Models/ModelSubKategori.php

    public function semua_sub_kategori()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = '.$this->table.'.id_kategori_buku')
            ->orderBy('id_sub_kategori', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_sub_kategori`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_sub_kategori`.`id_kategori_buku`
ORDER BY `id_sub_kategori` ASC