app/Models/ModelPengembalian.php

INSERT INTO `tb_pengembalian` (`id_pengembalian`, `id_member`, `id_buku`, `id_peminjaman`, `tanggal_pengembalian`, `hari_keterlambatan`, `total_pengembalian`, `total_denda`, `uang_dibayarkan`, `uang_kembalian`) VALUES (NULL, '4', 'BK-007', '58', '2024-02-21', '-', '2', '-', '-', '0')
---
    public function tambah_pengembalian($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);

SELECT *
FROM `tb_pengembalian`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_pengembalian`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_pengembalian`.`id_buku`
WHERE `tb_pengembalian`.`id_member` = '1'
---
    public function buku_dikembalikan_by_member($id_member)
    {
        $query = $this->db->table('tb_pengembalian');
        $result = $query->select('*')
            ->join('tb_member', 'tb_member.id_member = tb_pengembalian.id_member')
            ->join('tb_buku', 'tb_buku.id_buku = tb_pengembalian.id_buku')
            ->where('tb_pengembalian.id_member', $id_member)
            ->get()
            ->getResultArray();