app/Models/ModelKategoriBuku.php

INSERT INTO `tb_kategori_buku` (`nama_kategori_buku`) VALUES ('fiksi')
---
    public function tambah_kategori_buku($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);

SELECT *
FROM `tb_kategori_buku`
ORDER BY `id_kategori_buku` ASC
---
    public function semua_kategori_buku()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->orderBy('id_kategori_buku', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `tb_kategori_buku`
SELECT *
FROM `tb_kategori_buku`
ORDER BY `id_kategori_buku` ASC
---
    public function dapatkanKategoriBuku($id_kategori_buku = false)
    {
        if ($id_kategori_buku === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['id_kategori_buku' => $id_kategori_buku]);