app/Models/ModelRoles.php

SELECT *
FROM `tb_roles`
WHERE `email` = 'antonpetugas@gmail.com'
---
    public function dapatkan_user_role($email = false)
    {
        if ($email === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['email' => $email]);

SELECT *
FROM `tb_roles`
WHERE `role` = 'admin'
---
    public function semua_admin()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->where('role', 'admin')
            ->get()
            ->getResultArray();