app/Models/ModelBuku.php

    public function semua_buku()
    {
        $query = $this->db->table($this->table);
        $batasan = $query->select('*')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = '.$this->table.'.id_kategori_buku', 'left')
            ->join('tb_sub_kategori', 'tb_sub_kategori.id_sub_kategori = '.$this->table.'.id_sub_kategori', 'left')
            ->orderBy('id_buku', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_buku`
LEFT JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
LEFT JOIN `tb_sub_kategori` ON `tb_sub_kategori`.`id_sub_kategori` = `tb_buku`.`id_sub_kategori`
ORDER BY `id_buku` ASC

    public function dapatkan_buku($id_buku = false)
    {
        $this->select('*');
        $this->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = '.$this->table.'.id_kategori_buku');
---
SELECT *
FROM `tb_buku`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`