app/Models/ModelPeminjaman.php

    public function buku_dipinjam_by_member($id_member)
    {
        $query = $this->db->table('tb_peminjaman');
        $result = $query->select('*')
            ->join('tb_member', 'tb_member.id_member = tb_peminjaman.id_member')
            ->join('tb_buku', 'tb_buku.id_buku = tb_peminjaman.id_buku')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = tb_buku.id_kategori_buku')
            ->where('tb_peminjaman.id_member', $id_member)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_peminjaman`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_peminjaman`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_peminjaman`.`id_buku`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
WHERE `tb_peminjaman`.`id_member` = '2'

    public function getAllStatusDipinjam()
    {
        return $this->select('tb_peminjaman.*, tb_member.*, tb_buku.*, tb_kategori_buku.nama_kategori_buku')
            ->join('tb_member', 'tb_member.id_member = tb_peminjaman.id_member')
            ->join('tb_buku', 'tb_buku.id_buku = tb_peminjaman.id_buku')
            ->join('tb_kategori_buku', 'tb_kategori_buku.id_kategori_buku = tb_buku.id_kategori_buku')
            ->where('status_peminjaman', 'di-pinjam')
            ->orderBy('tanggal_peminjaman', 'DESC') // Urutan tanggal terbaru (DESC)
            ->get()
            ->getResultArray();
---
SELECT `tb_peminjaman`.*, `tb_member`.*, `tb_buku`.*, `tb_kategori_buku`.`nama_kategori_buku`
FROM `tb_peminjaman`
JOIN `tb_member` ON `tb_member`.`id_member` = `tb_peminjaman`.`id_member`
JOIN `tb_buku` ON `tb_buku`.`id_buku` = `tb_peminjaman`.`id_buku`
JOIN `tb_kategori_buku` ON `tb_kategori_buku`.`id_kategori_buku` = `tb_buku`.`id_kategori_buku`
WHERE `status_peminjaman` = 'di-pinjam'
ORDER BY `tanggal_peminjaman` DESC

    public function edit_status_peminjaman($data, $id_peminjaman)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_peminjaman', $id_peminjaman);
        return $builder->update($data);
---
UPDATE `tb_peminjaman` SET `status_peminjaman` = 'di-kembalikan', `total_pinjam` = 0
WHERE `id_peminjaman` = '58'